Autodesk.Revit.DB.SchedulableField.GetName(Autodesk.Revit.DB.Document)
Gets the name of the field.
document:
The document in which the field will be used.
Returns:
The name of the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The parameter doesn't exist in document.
Since:
2013

Autodesk.Revit.DB.SchedulableField.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SchedulableField.ParameterId
The ID of the parameter displayed by the field.
Remarks:
Most non-calculated field types require a parameter ID.
The Count field doesn't have a parameter ID.
The parameter ID, or InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SchedulableField.FieldType
The type of data displayed by the field.
See ScheduleFieldType for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fieldType is not a schedulable field type
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.SchedulableField.op_Inequality(Autodesk.Revit.DB.SchedulableField,Autodesk.Revit.DB.SchedulableField)
Determines whether two SchedulableField are different.
first: The first SchedulableField.
second: The second SchedulableField.
Returns: True if the SchedulableField are different, otherwise false.

Autodesk.Revit.DB.SchedulableField.op_Equality(Autodesk.Revit.DB.SchedulableField,Autodesk.Revit.DB.SchedulableField)
Determines whether two SchedulableField are the same.
first: The first SchedulableField.
second: The second SchedulableField.
Returns: True if the SchedulableField are the same, otherwise false.

Autodesk.Revit.DB.SchedulableField.GetHashCode
Gets the integer value of the SchedulableField as hash code

Autodesk.Revit.DB.SchedulableField.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  The other object to evaluate.

Autodesk.Revit.DB.SchedulableField.#ctor(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId)
Creates a new SchedulableField.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldType is not a schedulable field type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.SchedulableField.#ctor(Autodesk.Revit.DB.ScheduleFieldType)
Creates a new SchedulableField.
fieldType:
The type of data displayed by the field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldType is not a schedulable field type
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.SchedulableField.#ctor
Creates a new SchedulableField.
Since:
2013

Autodesk.Revit.DB.SchedulableField
A non-calculated field eligible to be included in a schedule.
Remarks:
The SchedulableField class represents a non-calculated field that is
eligible to be included in a schedule.  A list of fields that can be
included in a schedule can be obtained from
ScheduleDefinition.GetSchedulableFields.
Since:
2013